wetube-playlist/app/controllers/playlists_controller.rb

  def show
    @playlist = Playlist.find(params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @playlist = Playlist.create
---
INSERT INTO "playlists" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 15 Jun 2013 22:25:59 UTC +00:00], ["updated_at", Sat, 15 Jun 2013 22:25:59 UTC +00:00]]