wetube-playlist/app/controllers/videos_controller.rb

INSERT INTO "videos" ("created_at", "duration", "title", "updated_at", "uploaded_at", "uploader", "url") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT "videos".* FROM "videos" WHERE "videos"."url" = 'http://www.youtube.com/watch?v=Ys7-6_t7OEQ' LIMIT 1
---
  def create
    @video = Video.find_or_create_by_url(params[:video][:url])